In [2]:
import pandas as pd
import numpy as np

In [3]:
#way2:downloading the data
df = pd.read_csv("data_science_student_marks.csv")
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88
493,497,Los Angeles,20,90,100,90,78,73
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [55]:
#1 Inspect the Data
#Q1)Print the first 10 rows of the dataset.
print(df.head(10))

   student_id   location  age  sql_marks  excel_marks  python_marks  \
0           4     Sydney   24         95           99            87
1           5      Tokyo   24         99           95            89
2           6     Berlin   22         72           70            99
3           7     London   23         97           90            74
4           8      Tokyo   22         91           71            79
5           9    Toronto   20         93           88            75
6          10      Tokyo   18         77           87           100
7          11    Toronto   21         78           90            88
8          12  Melbourne   24         80           95            87
9          13     London   19         97           80            96

   power_bi_marks  english_marks
0              82             75
1              86             82
2              79             77
3              72             85
4              80             75
5              93             72
6              98             93
7              79             72
8              90             94
9              97             86

In [56]:
#Q2)Print last 5 rows of the dataset.
print(df.tail(5))

     student_id     location  age  sql_marks  excel_marks  python_marks  \
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86

In [57]:
#Q3)Display column names, shape, and info.
print(df.columns,df.shape,df.info)

Index(['student_id', 'location', 'age', 'sql_marks', 'excel_marks',
       'python_marks', 'power_bi_marks', 'english_marks'],
      dtype='object') (497, 8) <bound method DataFrame.info of      student_id     location  age  sql_marks  excel_marks  python_marks  \
0             4       Sydney   24         95           99            87
1             5        Tokyo   24         99           95            89
2             6       Berlin   22         72           70            99
3             7       London   23         97           90            74
4             8        Tokyo   22         91           71            79
..          ...          ...  ...        ...          ...           ...
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
494         498        Paris   22         78           80            78
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
0                82             75
1                86             82
2                79             77
3                72             85
4                80             75
..              ...            ...
492              78             88
493              78             73
494              71             70
495              78             82
496              70             86

[497 rows x 8 columns]>

In [58]:
#2Selecting Columns and Rows
#Q1)Display only the location and python_marks columns.
df.iloc[:,[1,5]]

        location  python_marks
0         Sydney            87
1          Tokyo            89
2         Berlin            99
3         London            74
4          Tokyo            79
..           ...           ...
492     New York            98
493  Los Angeles            90
494        Paris            78
495  Los Angeles            78
496       London            93

[497 rows x 2 columns]

In [4]:
#Q2)Display the first 5 rows of sql_marks and excel_marks
df.iloc[:5,[3,4]]

   sql_marks  excel_marks
0         95           99
1         99           95
2         72           70
3         97           90
4         91           71

In [60]:
#Q3)Select the row for student_id 10.
df.loc[df["student_id"]==10]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
6,10,Tokyo,18,77,87,100,98,93

In [61]:
#3Filtering Rows
#Q1)Find all students who scored more than 90 in Python.
print(df[df["python_marks"] > 90])

     student_id     location  age  sql_marks  excel_marks  python_marks  \
2             6       Berlin   22         72           70            99
6            10        Tokyo   18         77           87           100
9            13       London   19         97           80            96
14           18    Melbourne   19         89           76            96
18           22  Los Angeles   22         83           73           100
..          ...          ...  ...        ...          ...           ...
481         485        Paris   21         89           98            96
484         488       Berlin   21         88           94            94
486         490        Tokyo   18         87          100            95
492         496     New York   23         71           92            98
496         500       London   22         85           87            93

     power_bi_marks  english_marks
2                79             77
6                98             93
9                97             86
14               93             71
18               75             85
..              ...            ...
481              83             79
484              77             81
486              89             85
492              78             88
496              70             86

[162 rows x 8 columns]

In [62]:
#Q2)Find students located in Tokyo with sql_marks 90.
print(df[(df["sql_marks"] == 90) & (df["location"] == "Tokyo")])

     student_id location  age  sql_marks  excel_marks  python_marks  \
263         267    Tokyo   20         90           94            97

     power_bi_marks  english_marks
263              85             73

In [5]:
#Q3)Find students whose age is 22 or 23.
print(df[(df["age"] == 22) | (df["age"] == 23)])

     student_id     location  age  sql_marks  excel_marks  python_marks  \
2             6       Berlin   22         72           70            99
3             7       London   23         97           90            74
4             8        Tokyo   22         91           71            79
15           19        Paris   22         72           92            70
18           22  Los Angeles   22         83           73           100
..          ...          ...  ...        ...          ...           ...
475         479       London   23         81           91            93
488         492       London   23         85           73            78
492         496     New York   23         71           92            98
494         498        Paris   22         78           80            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
2                79             77
3                72             85
4                80             75
15               82             83
18               75             85
..              ...            ...
475              81             75
488              81             96
492              78             88
494              71             70
496              70             86

[125 rows x 8 columns]

In [68]:
#Q4)Find students who scored more than 80 in Python or more than 90 in Excel
print(df[(df["python_marks"] > 80) | (df["excel_marks"] > 90)])

     student_id     location  age  sql_marks  excel_marks  python_marks  \
0             4       Sydney   24         95           99            87
1             5        Tokyo   24         99           95            89
2             6       Berlin   22         72           70            99
6            10        Tokyo   18         77           87           100
7            11      Toronto   21         78           90            88
..          ...          ...  ...        ...          ...           ...
491         495     New York   24         83           78            82
492         496     New York   23         71           92            98
493         497  Los Angeles   20         90          100            90
495         499  Los Angeles   21         96           93            78
496         500       London   22         85           87            93

     power_bi_marks  english_marks
0                82             75
1                86             85
2                79             77
6                98             93
7                79             72
..              ...            ...
491              84             84
492              78             88
493              78             73
495              78             82
496              70             86

[387 rows x 8 columns]

In [69]:
#4 Using .isin() , .between() , .str
#Q1)Select students located in London, Sydney, or Berlin.
df[df["location"].isin(["London", "Sydney", "Berlin"])]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
9,13,London,19,97,80,96,97,86
16,20,Berlin,25,92,87,81,79,98
...,...,...,...,...,...,...,...,...
476,480,London,19,94,89,79,88,85
477,481,Sydney,24,70,79,80,83,78
484,488,Berlin,21,88,94,94,77,81
488,492,London,23,85,73,78,81,96
496,500,London,22,85,87,93,70,86

In [70]:
#Q2)Select students with age between 21 and 24.
df[df["age"].between(21, 24)]

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,85
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,84
492,496,New York,23,71,92,98,78,88
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [71]:
#5 Sorting
#Q1)Sort students by python_marks descending.
df.sort_values(by="python_marks", ascending=False)

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
18,22,Los Angeles,22,83,73,100,75,85
369,373,Sydney,19,81,83,100,74,72
123,127,Sydney,23,71,72,100,91,95
311,315,London,23,100,77,100,81,70
154,158,Sydney,23,82,100,100,98,75
...,...,...,...,...,...,...,...,...
371,375,Toronto,22,78,72,70,86,77
194,198,Melbourne,24,94,72,70,98,86
438,442,Berlin,18,89,79,70,93,76
431,435,Los Angeles,19,70,78,70,71,70
53,57,Sydney,25,87,89,70,83,71

In [72]:
#Q2)Sort by location ascending and sql_marks descending.
df.sort_values(by=["location", "sql_marks"], ascending=[True, False])

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
34,38,Berlin,21,100,95,78,73,77
85,89,Berlin,20,99,85,86,86,80
333,337,Berlin,19,98,81,88,71,70
155,159,Berlin,25,97,82,84,88,99
205,209,Berlin,23,95,78,74,96,88
...,...,...,...,...,...,...,...,...
201,205,Toronto,19,73,85,95,96,87
148,152,Toronto,18,72,84,82,71,79
237,241,Toronto,19,72,75,95,71,80
239,243,Toronto,24,72,86,93,72,80
452,456,Toronto,23,71,80,82,75,96

In [73]:
#Q3)Sort the DataFrame by age ascending, then english_marks descending
df.sort_values(by=["age", "english_marks"], ascending=[True, False])

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
19,23,New York,18,80,73,94,89,100
203,207,Los Angeles,18,95,83,94,89,100
257,261,Melbourne,18,83,91,91,95,99
387,391,Sydney,18,85,76,71,86,99
389,393,Melbourne,18,78,90,97,99,99
...,...,...,...,...,...,...,...,...
483,487,Los Angeles,25,74,79,81,87,72
53,57,Sydney,25,87,89,70,83,71
356,360,Melbourne,25,99,86,100,90,71
381,385,Tokyo,25,87,70,92,91,71
68,72,Berlin,25,91,73,83,88,70

In [74]:
#6 Adding / Modifying Columns
#Q1)Create a column total_marks which is the sum of all marks columns.
df["total_marks"] = df[["python_marks", "sql_marks", "excel_marks", "power_bi_marks", "english_marks"]].sum(axis=1)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks
0,4,Sydney,24,95,99,87,82,75,438
1,5,Tokyo,24,99,95,89,86,85,454
2,6,Berlin,22,72,70,99,79,77,397
3,7,London,23,97,90,74,72,85,418
4,8,Tokyo,22,91,71,79,80,75,396
...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427
493,497,Los Angeles,20,90,100,90,78,73,431
494,498,Paris,22,78,80,78,71,70,377
495,499,Los Angeles,21,96,93,78,78,82,427
496,500,London,22,85,87,93,70,86,421

In [75]:
#Q2)Create a column average_marks which is the mean of all marks columns.
df["average_marks"] = df[["python_marks", "sql_marks", "excel_marks", "power_bi_marks", "english_marks"]].mean(axis=1)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,average_marks
0,4,Sydney,24,95,99,87,82,75,438,87.6
1,5,Tokyo,24,99,95,89,86,85,454,90.8
2,6,Berlin,22,72,70,99,79,77,397,79.4
3,7,London,23,97,90,74,72,85,418,83.6
4,8,Tokyo,22,91,71,79,80,75,396,79.2
...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427,85.4
493,497,Los Angeles,20,90,100,90,78,73,431,86.2
494,498,Paris,22,78,80,78,71,70,377,75.4
495,499,Los Angeles,21,96,93,78,78,82,427,85.4
496,500,London,22,85,87,93,70,86,421,84.2

In [76]:
#Q3)Create a column passed which is Yes if average_marks = 75 else No
df["passed"] = np.where(df["average_marks"] >= 75, "Yes", "No")
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total_marks,average_marks,passed
0,4,Sydney,24,95,99,87,82,75,438,87.6,Yes
1,5,Tokyo,24,99,95,89,86,85,454,90.8,Yes
2,6,Berlin,22,72,70,99,79,77,397,79.4,Yes
3,7,London,23,97,90,74,72,85,418,83.6,Yes
4,8,Tokyo,22,91,71,79,80,75,396,79.2,Yes
...,...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427,85.4,Yes
493,497,Los Angeles,20,90,100,90,78,73,431,86.2,Yes
494,498,Paris,22,78,80,78,71,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,78,82,427,85.4,Yes
496,500,London,22,85,87,93,70,86,421,84.2,Yes

In [77]:
#7 Dropping Columns and Rows
#Q1)Drop the column power_bi_marks
df.drop("power_bi_marks", axis=1, inplace=True)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
0,4,Sydney,24,95,99,87,75,438,87.6,Yes
1,5,Tokyo,24,99,95,89,85,454,90.8,Yes
2,6,Berlin,22,72,70,99,77,397,79.4,Yes
3,7,London,23,97,90,74,85,418,83.6,Yes
4,8,Tokyo,22,91,71,79,75,396,79.2,Yes
...,...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,88,427,85.4,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

In [78]:
#Q2)Drop the row for student_id 496
df = df.drop(df[df["student_id"] == 496].index)
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
0,4,Sydney,24,95,99,87,75,438,87.6,Yes
1,5,Tokyo,24,99,95,89,85,454,90.8,Yes
2,6,Berlin,22,72,70,99,77,397,79.4,Yes
3,7,London,23,97,90,74,85,418,83.6,Yes
4,8,Tokyo,22,91,71,79,75,396,79.2,Yes
...,...,...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,411,82.2,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

In [79]:
#Q3)Drop the first 5 rows of the DataFrame
df = df.drop(df.index[:5])
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
5,9,Toronto,20,93,88,75,72,421,84.2,Yes
6,10,Tokyo,18,77,87,100,93,455,91.0,Yes
7,11,Toronto,21,78,90,88,72,407,81.4,Yes
8,12,Melbourne,24,80,95,87,94,446,89.2,Yes
9,13,London,19,97,80,96,86,456,91.2,Yes
...,...,...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,411,82.2,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

In [80]:
#8 Aggregation
#Q1)Calculate the average Python marks
df["python_marks"].mean()

np.float64(85.36048879837067)

In [81]:
#Q2)Find the maximum Excel marks.
df["excel_marks"].max()

np.int64(100)

In [82]:
#Q3)Calculate the average total marks by location.
df.groupby("location")["total_marks"].mean()

location
Berlin         420.588235
London         428.022222
Los Angeles    423.116667
Melbourne      425.396552
New York       427.125000
Paris          422.945455
Sydney         425.557692
Tokyo          427.603448
Toronto        423.553571
Name: total_marks, dtype: float64

In [83]:
#Q4)Count how many students scored more than 90 in SQL
(df["sql_marks"] > 90).sum()

np.int64(146)

In [84]:
#9 Using .loc and .iloc
#Q1)Select rows 10 to 20 and columns 
df.loc[10:20, :]

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
10,14,Toronto,20,81,74,88,96,438,87.6,Yes
11,15,Paris,24,94,93,87,71,425,85.0,Yes
12,16,Tokyo,19,73,82,78,84,387,77.4,Yes
13,17,Tokyo,25,82,75,77,85,397,79.4,Yes
14,18,Melbourne,19,89,76,96,71,425,85.0,Yes
15,19,Paris,22,72,92,70,83,399,79.8,Yes
16,20,Berlin,25,92,87,81,98,437,87.4,Yes
17,21,Toronto,24,85,96,84,96,432,86.4,Yes
18,22,Los Angeles,22,83,73,100,85,416,83.2,Yes
19,23,New York,18,80,73,94,100,436,87.2,Yes
20,24,Berlin,20,74,85,96,75,425,85.0,Yes

In [85]:
#Q2)Update english_marks of student_id to student_id 5 to 85.
df.loc[df["student_id"] == 5, "english_marks"] = 85
df

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
5,9,Toronto,20,93,88,75,72,421,84.2,Yes
6,10,Tokyo,18,77,87,100,93,455,91.0,Yes
7,11,Toronto,21,78,90,88,72,407,81.4,Yes
8,12,Melbourne,24,80,95,87,94,446,89.2,Yes
9,13,London,19,97,80,96,86,456,91.2,Yes
...,...,...,...,...,...,...,...,...,...,...
491,495,New York,24,83,78,82,84,411,82.2,Yes
493,497,Los Angeles,20,90,100,90,73,431,86.2,Yes
494,498,Paris,22,78,80,78,70,377,75.4,Yes
495,499,Los Angeles,21,96,93,78,82,427,85.4,Yes
496,500,London,22,85,87,93,86,421,84.2,Yes

In [86]:
#Q3)Select the 5th row, 3rd column using python_marks.iloc 
df.iloc[4, 2]

np.int64(19)

In [87]:
#10 Challenge: Combining Skills
#Q1)Find the top 5 students with highest average marks
df.sort_values(by="average_marks", ascending=False).head(5)

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
170,174,Melbourne,25,93,100,100,96,484,96.8,Yes
382,386,New York,19,94,91,99,99,468,93.6,Yes
234,238,Toronto,21,93,90,90,97,468,93.6,Yes
255,259,Paris,23,83,98,95,92,468,93.6,Yes
435,439,Berlin,21,92,99,96,88,467,93.4,Yes

In [88]:
#Q2)Find students from Los Angeles who scored more than 80 in all subjects
df[
    (df["location"] == "Los Angeles") &
    (df["python_marks"] > 80) &
    (df["sql_marks"] > 80) &
    (df["excel_marks"] > 80) &
    (df["english_marks"] > 80)
]

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
93,97,Los Angeles,18,82,99,95,87,433,86.6,Yes
126,130,Los Angeles,22,82,83,99,97,436,87.2,Yes
180,184,Los Angeles,25,99,88,96,90,463,92.6,Yes
203,207,Los Angeles,18,95,83,94,100,461,92.2,Yes
251,255,Los Angeles,19,88,83,99,99,451,90.2,Yes
253,257,Los Angeles,18,90,84,81,81,406,81.2,Yes
271,275,Los Angeles,22,87,87,97,89,435,87.0,Yes
349,353,Los Angeles,24,93,91,82,81,443,88.6,Yes
386,390,Los Angeles,25,91,84,83,88,435,87.0,Yes
390,394,Los Angeles,22,92,83,86,87,444,88.8,Yes
418,422,Los Angeles,21,87,100,88,81,440,88.0,Yes

In [89]:
#Q3)Find students whose total_marks is above 450 and age  23, then sort by total_marks descending.
df[
    (df["total_marks"] > 450) &
    (df["age"] >= 23)
].sort_values(by="total_marks", ascending=False)

,student_id,location,age,sql_marks,excel_marks,python_marks,english_marks,total_marks,average_marks,passed
170,174,Melbourne,25,93,100,100,96,484,96.8,Yes
255,259,Paris,23,83,98,95,92,468,93.6,Yes
180,184,Los Angeles,25,99,88,96,90,463,92.6,Yes
197,201,Melbourne,25,100,91,75,98,463,92.6,Yes
259,263,Melbourne,24,99,83,97,97,462,92.4,Yes
119,123,Sydney,23,92,89,83,98,459,91.8,Yes
103,107,New York,24,94,92,90,85,459,91.8,Yes
82,86,New York,25,93,88,93,99,458,91.6,Yes
154,158,Sydney,23,82,100,100,75,455,91.0,Yes